a1 = 0
b1 = 34345345
a2 = 0.1
b2 = 5e3
c = a1 + b1 + a2 + b2
print("a1 = ",a1,", b1 = ",b1,", a2 = ", a2,", b2 = ", b2)
print("c ჯამია - ", c)
print("c ცვლადის ტიპია ", type(c))

d = 100 / 3
print(d) # ვღებულობთ მთელ რიცხვს
print("შედეგის ტიპია ", type (d))
d = 100 // 3
print(d) # ვღებულობთ ნატურალურ რიცხვს
print("შედეგის ტიპია ", type (d))

f = 100 % 30
print("ვღებულობთ ნაშთს ", f)

g = 3**2    # ხარისხში აყვანა
print(g)
g = 16**(1/2)    # ფესვის ამოღება
print(g)

h = 10

h += 2  # ოპერაციები საკუთარ თავზე
print(h)

h *= 2
print(h)

h /= 3
print(h)