a = 12
b = 12.567
c = -123e5

print(f"რიცხვი {a} პლიუს რიცხვი {b} ტოლია {a+b}") # f- ფორმატირებული ტექსტი, {}-ტექსტის შიგნით ფიგურულ ფრჩხილებში მოცემულს განიხილავს რიგორც რიცხვებს
###############################
print(a, b, c, sep=" %% ", end="!") # sep - რა გვინდა იყოს მათ შორის, end - რითი დასრულდება და თუ გადატანა არ არის მითითებული იგივე სტრიქონში დარჩება.
###############################
print("\nვიანგარიშოთ პერიმეტრი")
m= float (input("შეიყვანეთ მართკუთხედის სიგრძე: "))
n= float (input("შეიყვანეთ მართკუთხედის სიგანე: "))
print(f"პერიმეტრი ტოლია: {(m+n)*2}")