string = "Hello World"
print("სტრიქონის სიგრძეა: ", len(string))
"""
H  e  l  l  o     W  o  r  l  d
0  1  2  3  4  5  6  7  8  9  10
"""
print("შეიყვანეთ ",len(string)," ზე ნაკლები რიცხვი: ")
chois=int(input("არჩევანი :")) # ეტყობა input()-ს არ უყვარს რთული არგუმენტი
print("ეს არის ასო: ",string[chois]) # აქ რთულიარგუმენტი მუშაობს
print(string[5:10], "ვბეჭდავთ მითითებულ ინდექსებში")
print(string[:chois], "ვბეჭდავთ არჩეულ ინდექსამდე")
print(string[chois:], "ვბეჭდავთ არჩეული ინდექსის მერე")
print(string[::2], "ვბეჭდავთ ყველაფერს ბიჯით 2")
print(string[5:10:2], "ვბეჭდავთ მეხუთედან_სინამდვილეში მეექვსედან : მეათემდე : ბიჯით 2")
print(string[::-1], "უარყოფითი ბიჯისას მოდის უკნიდან წინ")